In [1]:
import pandas as pd

In [2]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

# pd.concat() Method

In [3]:
len(week1)

250

In [4]:
len(week2)

250

In [5]:
pd.concat([week1, week2]).tail()

     Customer ID  Food ID
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

In [6]:
pd.concat([week1, week2], ignore_index=True).tail()

     Customer ID  Food ID
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

In [7]:
pd.concat([week1, week2], keys=["Week 1", "Week 2"]).tail()

            Customer ID  Food ID
Week 2 245          783       10
       246          556       10
       247          547        9
       248          252        9
       249          249        6

In [8]:
sales = pd.concat([week1, week2], keys=["A", "B"])

In [9]:
sales.loc["B"].loc[5]

Customer ID    310
Food ID          5
Name: 5, dtype: int64

In [10]:
sales.loc[("B", 5)]

Customer ID    310
Food ID          5
Name: (B, 5), dtype: int64

In [11]:
sales.loc[("B", 5), "Customer ID"]

310

# The .append() Method

In [12]:
week1.append(week2).head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [13]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [14]:
week2.tail(2)

     Customer ID  Food ID
248          252        9
249          249        6

In [15]:
week1.append(week2).tail(2)

     Customer ID  Food ID
248          252        9
249          249        6

# Inner Joins

In [17]:
week1.merge(week2, how='inner', on="Customer ID").head(4)

   Customer ID  Food ID_x  Food ID_y
0          537          9          5
1          155          9          3

In [19]:
week1.merge(week2, how='inner', on="Customer ID", 
            suffixes=('_1', '_2')).head(4)

   Customer ID  Food ID_1  Food ID_2
0          537          9          5
1          155          9          3
2          155          1          3
3          503          5          8

In [20]:
week1[week1["Customer ID"] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [21]:
week2[week2["Customer ID"] == 155]

     Customer ID  Food ID
208          155        3

In [24]:
week1.merge(week2, how='inner', on=["Customer ID", "Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [25]:
week1[week1["Customer ID"] == 21]

     Customer ID  Food ID
101           21        4
212           21        4

In [26]:
week2[week2["Customer ID"] == 21]

    Customer ID  Food ID
30           21        4